{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "dtype": "float32", "activity_regularizer": null, "input_length": 136, "batch_input_shape": [null, 136], "embeddings_regularizer": null, "name": "embedding_1", "output_dim": 128, "trainable": true, "input_dim": 3000, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "mask_zero": false}}, {"class_name": "LSTM", "config": {"dropout": 0.5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_regularizer": null, "return_state": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.5, "kernel_regularizer": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "trainable": true, "bias_regularizer": null, "units": 198, "activation": "tanh", "stateful": false, "return_sequences": true, "bias_constraint": null, "kernel_constraint": null, "unroll": false, "name": "lstm_1", "use_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dropout": 0.5, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_regularizer": null, "return_state": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.5, "kernel_regularizer": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "trainable": true, "bias_regularizer": null, "units": 198, "activation": "tanh", "stateful": false, "return_sequences": false, "bias_constraint": null, "kernel_constraint": null, "unroll": false, "name": "lstm_2", "use_bias": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.009999999776482582, "l2": 0.0}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "units": 64}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "units": 2}}], "backend": "tensorflow", "keras_version": "2.1.2"}